In [1]:
import pandas as pd
import numpy as np

### Pandas Where

We will run through 3 examples:
1. Pandas Where with *DataFrame* condition
2. Pandas Where with *Series* condition
3. Pandas Where with *Callable* condition
4. Pandas Where with *Callable* other
5. Pandas Where with *DataFrame* other

But first, let's create our DataFrame of students and test scores

In [2]:
np.random.seed(seed=42)

df = pd.DataFrame(data=np.random.randint(0,100,(4,3)),
                  columns=('Test1', 'Test2', 'Test3'),
                  index=['Bob', 'Sally', 'Frank', 'Patty']
                 )
df

       Test1  Test2  Test3
Bob       51     92     14
Sally     71     60     20
Frank     82     86     74
Patty     74     87     99

### 1. Pandas Where with DataFrame condition

To start off, let's use a DataFrame in our condition parameter. I want to see all test scores that are above 90. This means to evaluate the scores as FALSE I need to look for all scores BELOW 90. 

I'll replace the >90 with "A+." Notice how I first evaluate the DataFrame, check out where the FALSES are. These will get replaced.

In [3]:
df<90

       Test1  Test2  Test3
Bob     True  False   True
Sally   True   True   True
Frank   True   True   True
Patty   True   True  False

In [4]:
df.where(df<90, "A+")

       Test1 Test2 Test3
Bob       51    A+    14
Sally     71    60    20
Frank     82    86    74
Patty     74    87    A+

### 2. Pandas Where with Series condition

Say you wanted to fill an entire row based off of the condition of a single Pandas Series. You can also pass a series as the conditional.

Here, I'll replace a all values in the row where Test3<90

In [5]:
df['Test3']<90

Bob       True
Sally     True
Frank     True
Patty    False
Name: Test3, dtype: bool

In [6]:
df.where(df['Test3']<90, "A+")

      Test1 Test2 Test3
Bob      51    92    14
Sally    71    60    20
Frank    82    86    74
Patty    A+    A+    A+

### 3. Pandas Where with Callable condition
You can also pass a *callable* condition to your where cond parameter. This means you can pass a function to evaluate your value. Here I'll use a lambda function, but you can use a regular function as well.

In [7]:
df.where(lambda x: x<75, "A+")

      Test1 Test2 Test3
Bob      51    A+    14
Sally    71    60    20
Frank    A+    A+    74
Patty    74    A+    A+

### 4. Pandas Where with Callable other
Say you wanted to replace your FALSE conditions with a dynamic value. You can also pass a *callable* into your other parameter

In [8]:
df.where(df<90, lambda x: x**2)

       Test1  Test2  Test3
Bob       51   8464     14
Sally     71     60     20
Frank     82     86     74
Patty     74     87   9801

### 5. Pandas Where with DataFrame other
Finally, you can pass a DataFrame into your other parameter to replace your False values. Think of this as *selectively* copying over values from another DataFrame to your originally DataFrame.

I'll start by making another DataFrame. Notice how only the values that are FALSE in the condition below are the ones that are replaced.

In [9]:
np.random.seed(seed=41)

df2 = pd.DataFrame(data=np.random.randint(0,100,(4,3)),
                  columns=('Test1', 'Test2', 'Test3'),
                  index=['Bob', 'Sally', 'Frank', 'Patty']
                 )
df2

       Test1  Test2  Test3
Bob       64     35     12
Sally     98     80     65
Frank     89     23     85
Patty     26     56      3

In [10]:
df.where(df<90, df2)

       Test1  Test2  Test3
Bob       51     35     14
Sally     71     60     20
Frank     82     86     74
Patty     74     87      3